lib/tasks/webserver.rake

DELETE FROM "webpages" WHERE "webpages"."id" = ?  [["id", 3]]
---
  task clear_database: :environment do
    Webpage.destroy_all