lib/web_server_visit.rb

INSERT INTO "webpages" ("page_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["page_name", "/help_page/1"], ["created_at", "2022-08-26 04:21:07.916386"], ["updated_at", "2022-08-26 04:21:07.916386"]]
SELECT "webpages".* FROM "webpages" WHERE "webpages"."page_name" = ? LIMIT ?  [["page_name", "/help_page/1"], ["LIMIT", 1]]
INSERT INTO "servers" ("ip_address", "created_at", "updated_at") VALUES (?, ?, ?)  [["ip_address", "126.318.035.038"], ["created_at", "2022-08-26 04:28:15.808681"], ["updated_at", "2022-08-26 04:28:15.808681"]]
SELECT "servers".* FROM "servers" WHERE "servers"."ip_address" = ? LIMIT ?  [["ip_address", "126.318.035.038"], ["LIMIT", 1]]
INSERT INTO "visits" ("webpage_id", "server_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["webpage_id", 5], ["server_id", nil], ["created_at", "2022-08-26 04:21:07.946119"], ["updated_at", "2022-08-26 04:21:07.946119"]]
---
  def self.import_webserver_file(filename)

    begin

      raise 'Input file is required' unless filename.present?
      file_path = IMPORT_DIRECTORY + filename
      raise 'Input file not found' unless File.exist?(file_path)

      File.open(file_path).readlines.each do |line|

        page_name, ip_address = line.split

        Rails.logger.debug( "page_name: #{page_name}, ip_address: #{ip_address}" )

        webpage = Webpage.find_or_create_by(page_name: page_name)
        server = Server.find_or_create_by(ip_address: ip_address)

        if webpage && server
          page_visit = Visit.new(webpage: webpage, server: server)
          page_visit.save

SELECT COUNT(*) AS "count_all", "webpages"."page_name" AS "webpages_page_name" FROM "webpages" INNER JOIN "visits" ON "visits"."webpage_id" = "webpages"."id" GROUP BY "webpages"."page_name"
---
  def self.most_page_views
     Webpage.joins(:visits).group('page_name').order('COUNT(visits.id) DESC').count